""" Persian description 
! محاسبه اعداد اعشاری - مسائل و محدودیت ها

در سخت افزار کامپیوتر بصورت دو دویی یا باینری محاسبه می شوند Floating-point numbers
در سیستم ده دهی اعداد اعشاری به این صورت ارزش بندی میشوند
? decimal fraction:
0.625 = 6/10 + 2/100 + 5/1000

در سیستم دودویی هم به این صورت
? binary fraction:
0.101 = 1/2 + 0/4 + 1/8 = 
  |||
  |||
  |||
  |||___ 1 * 2 ^ -3 = 0.125 --]
  ||
  ||___ 0 * 2 ^ -2 = 0      --|----> 0.125 + 0 + 0.5 = 0.625 (بر پایه ده - decimal)
  |
  |___ 1 * 2 ^ -1 = 0.5     --]
این دو کسر مقادیر یکسانی دارند، تنها تفاوت واقعی این است که اولی با نماد کسری پایه 10 و دومی در پایه 2 نوشته شده است

مشکل محاسبه در اعداد اعشاری در پایه 10 خیلی قابل فهم تر است
کسر 1/3 را در نظر بگیرید و بخواهیم با پایه 10 تقربی بزنیم
میشه:
0.3
بهترش کنیم
0.33
یا بهتر:
0.333
نتیجه هرگز دقیقاً 1/3 نخواهد بود و به آن میتونیم نزدیک شیم

در پایه 2 کسر 1/10 بی نهایت تکراری می باشد.
0.0001100110011001100110011001100110011001100110011...

در بیشتر ماشین های امروزی اعداد اعشاری با کمک روش زیر تخمین زده میشن:
پنجاه و سه بیت که از مهم ترین بیت شروع میشود binary fraction در صورت کسر




"""